package ierror

// ErrorConfig 错误码定义
var errorConfig = map[int]string{
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* DUMMY 0 ~ -200
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	0:  "操作成功",
	-1: "操作失败",
	-2: "系统密钥验证失败,given:%v",
	-4: "数据库操作失败, errmsg: %s.",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 用户相关 -200 ~ -299
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-204: "钻石余额不足，需要:%d",
	-300: "道具不足",
	-701: "金币余额不足",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 协议相关
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10100: "协议解析错误:%v,err:%v",
	-10101: "参数错误,func:%v,param:%v,given:%v",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 用户相关 -200 ~ -299
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10200: "User: User was offline, userID:%v.",
	-10201: "User: User is not in club, userID:%v, clubID:%v.",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 联赛相关 -500 ~ -599
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10500: "比赛未开放, leagueId:%v, userId:%v",
	-10501: "报名未开始或已结束, leagueId:%v, userId:%v, 报名开始时间:%v, 报名结束时间:%v",
	-10502: "比赛报名人数已满, leagueId:%v, raceId:%v, userId:%v",
	-10503: "用户已报名, leagueId:%v, raceId:%v, userId:%v",
	-10504: "报名失败, leagueId:%v, raceId:%v, userId:%v, err:%v",
	-10505: "比赛未找到, raceId:%v, userId:%v",
	-10506: "比赛已开始, raceId:%v, userId:%v, 开始时间:%v",
	-10507: "比赛取消报名已截止, raceId:%v, userId:%v, 截止时间:%v",
	-10508: "未报名参赛, raceId:%v, userId:%v",
	-10509: "取消报名失败, raceId:%v, userId:%v, err:%v",
	-10510: "现在不允许放弃比赛, raceId:%v, userId:%v, race status:%v, giveup status :%v, err:%v",
}
