package config

var ErrorConfig = map[int]string{
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* DUMMY 0 ~ -200
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	0:  "操作成功",
	-1: "操作失败",
	-2: "decode token失败",
	-3: "token转json失败，失败原因: %s",
	-4: "数据库操作失败, errmsg: %s.",
	-5: "系统密钥错误",
	-6: "参数错误,action:%v,name:%v,given:%v",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 用户相关 -200 ~ -299
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-201: "User: user not connected, userId: %d.",
	-202: "您已在房间号“%v”的房间",
	-203: "User: user is not in room, userId: %d, expect roomId:%d.",
	-204: "钻石余额不足，需要:%d",
	-211: "握手: 用户数据中未找到token, user:%#v",
	-212: "握手: 从token中解析userId错误, token:%s",
	-213: "握手: 用户账号未找到, userId:%d",
	-214: "非观察员不允许进行此操作, userId:%d",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 房间相关 -300 ~ -399
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-300: "Room: room not exists, roomId: %d",
	-301: "Room: create room failed, number exists, number: %s.",
	-302: "Room: 房间不存在或者已解散, number: %s.",
	-303: "房间人数已满, 房间号: %s.",
	-304: "游戏已开始，不允许退出，userId:%d, roomeId: %d.",
	-305: "麻将类型暂不允许随机组队, mType: %d",
	-306: "游戏尚未开始，无需解散，roomId:%d",
	-307: "游戏正在解散中，roomId:%d",
	-309: "游戏未处于解散中，roomId:%d",
	-310: "已回应过解散请求，roomId:%d, userId:%d.",
	-312: "房间状态错误，当前: %d, 需求: %d.",
	-313: "未轮到用户操作，userId:%d, roomId:%d, opCode:%v, tiles:%v.",
	-314: "用户当前不可以进行此操作，userId:%d, roomId:%d, op:%d.",
	-315: "操作已回应，userId:%d, roomId:%d, op:%d.",
	-316: "客户端不允许发起此操作，userId:%d, roomId:%d, op:%d.",
	-317: "未支持的操作类型，userId:%d, roomId:%d, op:%d.",
	-318: "规则的详细检测未通过，userId:%d, roomId:%d, op:%d.",
	-319: "房间口令错误",
	-320: "此房间不允许加入",
	-321: "版本不兼容，请升级新版本",
	-322: "rbt只允许加入房间",
	-323: "游戏未开始, 不允许托管, roomId:%d, userId:%d",
	-324: "未支持的比赛类型, userId:%d, gameType:%d",
	-325: "比赛配置未设置, userId:%d, gameType:%d",
	-326: "牌局张数不匹配, 游戏类型: %d, 张数:%d",
	-327: "牌局人数不匹配, 游戏类型: %d, 人数:%d",
	-328: "此房间不允许观察, roomId:%v",
	-329: "已经观察了此房间, roomId:%v",
	-330: "游戏中的房间不允许直接结束, roomId:%v",
	-331: "用户不允许访问TV端, userId:%v",
	-332: "前后鸡与滚筒鸡不能同时开启, userId:%v",
	-333: "非俱乐部成员, 不能从俱乐部创建房间, userId:%v,clubId:%v",
	-334: "非俱乐部成员, 不能加入俱乐部房间, userId:%v,clubId:%v",
	-335: "淘汰赛积分不足, 不能创建或加入俱乐部房间, userId:%v,clubId:%v,require:%v,have:%v.",
	-336: "会长已禁止俱乐部创建房间",
	-337: "您的奖品赛正在进行中，不允许加入房间",
	-338: "您的奖品赛快开始了，不允许加入房间",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 游戏相关 -500 ~ -599
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-500: "麻将类型错误，mType: %d",
	-501: "麻将局数错误, 未找到价格配置, round: %d",
	-510: "游戏未处于准备状态",
	-511: "已经准备过了",
	-512: "游戏未处于检查作弊状态",
	-513: "已经回应过作弊状态",
	-550: "用户手牌数不足，tile: %d, 需要: %d, 拥有: %d",
	-552: "内部胡牌算法错误, userId: %d, hCard: %v",
	-553: "读取最后操作的牌错误, userId: %d",
	-554: "删除最后一张弃牌出错.",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 麻将馆 -600 ~ -699
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-600: "麻将馆未找到, clubId:%v",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 麻将馆 -700 ~ -799
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-700: "金币场配置未找到,userId:%v,coinType:%v,gType:%v",
	-701: "金币数不足,userId:%v,需要:%v,拥有:%v",
	-702: "金币数溢出,userId:%v,上限:%v,拥有:%v",
	-703: "玩法配置未找到,userId:%v,gType:%v",
	-704: "只有麻将馆主后台创建的房间才可以结束,roomId:%v",
	-705: "游戏已经开始，不能解散,roomId:%v",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 跟info同步
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-1002: "这个房间已经解散了",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 联赛相关 -10500 ~ -10599
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10500: "比赛房间未找到, raceRoomId:%v",
	-10501: "创建比赛房间失败, raceRoomId:%v, raceId:%v",
	-10502: "比赛信息未找到, raceId:%v",
	-10503: "联赛信息未找到, leagueId:%v",
	-10504: "更新raceRoom失败, raceRoomId:%v, raceId:%v, err:%v",
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 排位相关 -10600 ~ -10699
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10600: "赛季未开始, userId:%v",
	-10601: "参数数据缺失, userId:%v",
	-10602: "参赛卡不足, userId:%v, 消耗:%v, 拥有:%v",
	-10603: "注意健康游戏 哦，已经名列前茅了，明天再来吧",
}
