package config

// Errors 错误码定义
var Errors = map[int][2]string{
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* DUMMY 0 ~ 200
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	0:  [2]string{"操作成功", "操作成功"},
	-1: [2]string{"操作失败", "操作失败"},
	-2: [2]string{"签名错误", "系统密钥验证失败,given:%v"},

	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 协议相关
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-10100: [2]string{"请求失败", "协议解析错误:%v,err:%v"},
	-10101: [2]string{"请求失败", "参数错误,func:%v,param:%v,given:%v"},
	-10102: [2]string{"请求失败", "未支持的消息id, act:%v"},
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 用户相关 200 ~ 299
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-201: [2]string{"请先登陆游戏", "用户未登录, userId:%v"},
	-212: [2]string{"无效的token", "握手: 从token中解析userId错误, token:%v"},
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* 选服相关
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	-1001: [2]string{"未传递userid参数", "未传递userid参数"},
	-1002: [2]string{"这个房间已经解散了", "这个房间已经解散了"},
	-1007: [2]string{"登录已失效，请退出重新登录", "登录已失效，请退出重新登录"},
	-1015: [2]string{"很抱歉这个房间出问题了", "很抱歉这个房间出问题了"},
	-1019: [2]string{"后台唤起时，房间解散或不存在", "后台唤起时，房间解散或不存在"},
	-1020: [2]string{"游戏服务器目前维护中，请稍候重试", "游戏服务器目前维护中，请稍候重试"},
	-1030: [2]string{"无可用的游戏服", "无可用的游戏服"},
}
