package ierror

// ErrorConfig 错误码定义
var errorConfig = map[int]string{
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	//-* DUMMY 0 ~ -200
	//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
	0:  "操作成功",
	-1: "操作失败",
	-2: "参数缺失, action:%v, param:%v",
	-3: "参数错误, action:%v, param:%v, given:%v",
	-4: "服务器不支持此端口, server:%v, port:%v",
	-5: "服务器未安装此版本，请先安装, server:%v, version:%v",
	-6: "执行命令失败, server:%v, command:%v",
	-7: "版本未安装, server:%v, version:%v",
}
