package config

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
//-* DUMMY
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
const (
	TOKEN_SECRET_KEY          = "Tq-TqRIqf8fuck" // token密钥
	SYSTEM_KEY                = "fkmaxrmxxoo"          // 系统消息密钥
	DISMISS_ROOM_CODE_TIMEOUT = 4                   // 房间超时解散（这里定义成与game服务器一致，减少客户端判断逻辑）
)

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
//-* 俱乐部消息
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
const (
	CLUB_MESSAGE_LIST_LENGTH = 100    // 俱乐部消息列表最大保留条数
	CLUB_MESSAGE_LIST_LIMIT  = 10     // 俱乐部单次消息拉取条数默认值
	CLUB_MESSAGE_TIMEOUT     = 172800 // 俱乐部消息过期时长
)

//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
//-* 用户
//-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-
const (
	CACHE_KEY_USER_AVATAR_BOX = "USER:AVATAR:%v" // 用户头像框
)
